In [2]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/stock')
const = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3')
conlite = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3')
conlt = engine.connect()
engine = create_engine('sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3')
conmy = engine.connect()
engine = create_engine('mysql+pymysql://root:@localhost:3306/portfolio_development')
conpf = engine.connect()
engine = create_engine('postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development')
conpg = engine.connect()

### Name change

In [3]:
old_name = 'BKI'
new_name = 'BKIH'

In [4]:
sql = '''
SELECT *
FROM stockname
WHERE name = "%s"'''
sql = sql % (old_name)
stock = pd.read_sql(sql, const)
stock

  name category sector  inport  onwatch  hd  top100
0  BKI           INSUR       1        0   0       0

In [5]:
sql = '''
UPDATE stockname
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stockname
SET name = "BKIH"
WHERE name = "BKI"

In [6]:
rp = const.execute(sql)
rp.rowcount

1

In [7]:
sql = '''
SELECT *
FROM price
WHERE name = "%s"'''
sql = sql % (old_name)
price = pd.read_sql(sql, const)
price.shape

(1851, 7)

In [8]:
sql = '''
UPDATE price
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE price
SET name = "BKIH"
WHERE name = "BKI"

In [9]:
rp = const.execute(sql)
rp.rowcount

1851

In [10]:
sql = '''
UPDATE stocks
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stocks
SET name = "BKIH"
WHERE name = "BKI"

In [11]:
rp = conlite.execute(sql)
rp.rowcount

0

In [12]:
sql = '''
UPDATE buy
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE buy
SET name = "BKIH"
WHERE name = "BKI"

In [13]:
rp = const.execute(sql)
rp.rowcount

0

### Tickers table

In [14]:
sql = '''
SELECT *
FROM tickers
WHERE name = "%s"'''
sql = sql % (old_name)
ticker = pd.read_sql(sql, conlt)
ticker

,id,name,full_name,sector,subsector,market,website,created_at,updated_at
0,68,BKI,BANGKOK INSURANCE PUBLIC COMPANY LIMITED,Financials,Insurance,SET,www.bangkokinsurance.com,2017-07-23 06:30:50.764348,2017-07-23 06:30:50.764348

In [15]:
sql = '''
UPDATE tickers
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE tickers
SET name = 'BKIH'
WHERE name = 'BKI'

In [16]:
rp = conlt.execute(sql)
rp.rowcount

1

In [17]:
rp = conmy.execute(sql)
rp.rowcount

1

In [18]:
rp = conpg.execute(sql)
rp.rowcount

1

### Stocks table

In [19]:
sql = '''
UPDATE stocks
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stocks
SET name = 'BKIH'
WHERE name = 'BKI'

In [20]:
rp = conlt.execute(sql)
rp.rowcount

1

In [21]:
rp = conmy.execute(sql)
rp.rowcount

1

In [22]:
rp = conpg.execute(sql)
rp.rowcount

1

### EPSS table

In [23]:
sql = '''
UPDATE epss
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE epss
SET name = 'BKIH'
WHERE name = 'BKI'

In [24]:
rp = conlt.execute(sql)
rp.rowcount

47

In [25]:
rp = conpg.execute(sql)
rp.rowcount

47

### QT_PROFITS table

In [26]:
sql = '''
UPDATE qt_profits
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE qt_profits
SET name = 'BKIH'
WHERE name = 'BKI'

In [27]:
rp = conlt.execute(sql)
rp.rowcount

35

### YR_PROFITS table

In [28]:
sql = '''
UPDATE yr_profits
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE yr_profits
SET name = 'BKIH'
WHERE name = 'BKI'

In [29]:
rp = conlt.execute(sql)
rp.rowcount

36

In [30]:
rp = conpg.execute(sql)
rp.rowcount

36

### PROFITS table

In [31]:
sql = '''
UPDATE profits
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE profits
SET name = 'BKIH'
WHERE name = 'BKI'

In [32]:
rp = conlt.execute(sql)
rp.rowcount

0

In [33]:
rp = conmy.execute(sql)
rp.rowcount

0

In [34]:
rp = conpg.execute(sql)
rp.rowcount

0

### CONSENSUS table

In [35]:
sql = '''
UPDATE consensus
SET name = '%s'
WHERE name = '%s'
'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE consensus
SET name = 'BKIH'
WHERE name = 'BKI'

In [36]:
rp = conlt.execute(sql)
rp.rowcount

1

In [37]:
rp = conmy.execute(sql)
rp.rowcount

1

In [38]:
rp = conpg.execute(sql)
rp.rowcount

0

### Portfolio database

In [39]:
sql = '''
SELECT * 
FROM stocks
WHERE name = '%s'
'''
sql = sql % old_name
df_tmp = pd.read_sql(sql, conpf)
df_tmp

    id name  category_id website
0  180  BKI            3

In [40]:
sql = '''
UPDATE stocks
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE stocks
SET name = "BKIH"
WHERE name = "BKI"

In [41]:
rp = conpf.execute(sql)
rp.rowcount

1

In [42]:
sql = '''
SELECT * 
FROM dividends
WHERE name = '%s'
'''
sql = sql % old_name
df_tmp = pd.read_sql(sql, conpf)
df_tmp

,id,stock_id,name,year,quarter,number,ppu,amt,net,x_date,p_date
0,279,180,BKI,2021,2,1000,3.5,3500.0,3150.0,2021-09-23,2021-10-08

In [43]:
sql = '''
UPDATE dividends
SET name = "%s"
WHERE name = "%s"'''
sql = sql % (new_name, old_name)
print(sql)

UPDATE dividends
SET name = "BKIH"
WHERE name = "BKI"

In [44]:
rp = conpf.execute(sql)
rp.rowcount

1

### Manually chage name-ttl.csv & price-uploads.csv